{"aapi 198. directed group study": 1, "aapi 87. first-year seminar": 2, "aas 10. introduction to african american studies": 3, "aas 11. introduction to black diasporic studies": 4, "aas 14. introduction to african studies": 5, "aas 15. racism and global imperialism": 6, "aas 170. legacies of research on disenfranchised communities": 7, "aas 171. service learning in non-profits": 8, "aas 172. scholarly practicum": 9, "aas 179. capstone for black and african american studies": 10, "aas 190. special topics in african american studies": 11, "aas 191. special topics: explorations of science in black diaspora and african american studies": 12, "aas 193. special topics: social science research and theory in black diaspora and african american studies": 13, "aas 194. special topics: art and humanities in black diaspora and african american studies": 14, "aas 197. internship program": 15, "aas 198. directed group study in african american studies": 16, "aas 199. independent study in african american studies": 17, "aas 87. first-year student seminar": 18, "aas/ansc 185. #blacklivesmatter": 19, "aese 241. decision and risk analysis": 20, "aese 261. managing stakeholder relationships": 21, "aese 278a. complexity and large-scale systems": 22, "aese 278b. enterprise architecting": 23, "aese 278c. modeling, simulation, and analysis": 24, "aese 278d. engineering essentials for open, distributed systems": 25, "aese 278e. patterns for enterprise architecting": 26, "aese 279a. architecture-based enterprise systems engineering quarterly team project": 27, "aese 279b. architecture-based enterprise systems engineering capstone team project": 28, "aip 197. academic internship program": 29, "aip 197dc. ucdc: washington, dc internship": 30, "aip 197p. public service internship": 31, "aip 197t. academic internship program\u2014special programs": 32, "aip 97. academic internship": 33, "anar 100. special topics in anthropological archaeology": 34, "anar 104. introduction to geographic information systems": 35, "anar 105. the archaeology of literate societies in mesoamerica": 36, "anar 111. foundations of archaeology": 37, "anar 113. past, present, and future perspectives on natural resources in israel": 38, "anar 114. environmental hazards in israel": 39, "anar 115. coastal geomorphology and environmental change": 40, "anar 115b. coastal geomorphology and gis applications": 41, "anar 116. sea level change": 42, "anar 117. archaeological field and lab class, southern california": 43, "anar 118. archaeology of the uc san diego campus": 44, "anar 119s. archaeological field and lab class": 45, "anar 120. documenting climate change: past and present": 46, "anar 121. cyber-archaeology and world digital cultural heritage": 47, "anar 124. archaeology of asia": 48, "anar 135. ancient mediterranean civilization": 49, "anar 135s. ancient mediterranean civilization": 50, "anar 138. mesopotamia: the emergence of civilization": 51, "anar 141. prehistory of the holy land": 52, "anar 142. the rise and fall of ancient israel": 53, "anar 143. biblical archaeology": 54, "anar 144. pharaohs, mummies, and pyramids: introduction to egyptology": 55, "anar 145s. study abroad: egypt of the pharaohs": 56, "anar 146. feeding the world": 57, "anar 153. the mysterious maya": 58, "anar 154. the aztecs and their ancestors": 59, "anar 155. study abroad: ancient mesoamerica": 60, "anar 155s. study abroad: ancient mesoamerica": 61, "anar 156. the archaeology of south america": 62, "anar 157. early empires of the andes: the middle horizon": 63, "anar 157s. early empires of the andes: the middle horizon": 64, "anar 158. the inca: empire of the andes": 65, "anar 158gs. the inca": 66, "anar 159. pre-hispanic societies of the caribbean archipelago": 67, "anar 160. ancient maya: archaeological problems and perspectives": 68, "anar 164. underwater archaeology": 69, "anar 165. marine and coastal archaeology and the biblical seas": 70, "anar 166. introduction to environmental archaeology": 71, "anar 167. geoarchaeology in theory and practice": 72, "anar 180. archaeology workshop: advanced lab work in archaeology": 73, "anar 182. origins of agriculture and sedentism": 74, "anar 183. chiefdoms, states, and the emergence of civilizations": 75, "anar 184. empires in archaeological perspective": 76, "anar 185. middle east desert cultural ecology": 77, "anar 186. the human era: the archaeology of the anthropocene": 78, "anar 190. eastern mediterranean archaeological field school": 79, "anar 191. advanced cyber-archaeology field school": 80, "anar 191. advanced cyber-archaeology field school (12)": 81, "anbi 100. special topics in biological anthropology": 82, "anbi 109. brain mind workshop": 83, "anbi 111. human evolution": 84, "anbi 112. methods in human comparative neuroscience": 85, "anbi 114. methods in primate conservation": 86, "anbi 116. human sexuality in an evolutionary perspective": 87, "anbi 117. ancient genomics: who we are and how we got here": 88, "anbi 118. technology on the go: mobile tools for human biology": 89, "anbi 120. ethical dilemmas in biological anthropology": 90, "anbi 120. ethical dilemmas in biological anthropology (4)": 91, "anbi 121. the original moonshot: the voyaging achievements of the polynesian ancestors": 92, "anbi 130. biology of inequality": 93, "anbi 131. biology and culture of race": 94, "anbi 132. conservation and the human predicament": 95, "anbi 133. planet of the apes: evolution and ecology of the great ape": 96, "anbi 134. human evolutionary genetics": 97, "anbi 135. genetic anthropology lab techniques": 98, "anbi 136. human comparative neuroanatomy": 99, "anbi 139. evolution of human disease": 100, "anbi 140. the evolution of the human brain": 101, "anbi 141. the evolution of human diet": 102, "anbi 143. the human skeleton": 103, "anbi 143gs. the human skeleton in paris": 104, "anbi 144. human anatomy": 105, "anbi 144gs. the human anatomy in paris": 106, "anbi 145. bioarcheology": 107, "anbi 146. stable isotopes in ecology": 108, "anbi 148. not by genes alone: the ecology and evolution of primate behavior": 109, "anbi 149. social and behavioral epigenetics": 110, "anbi 159. biological and cultural perspectives on intelligence": 111, "anbi 173. how monkeys see the world": 112, "anbi 174. conservation and the media: film lab": 113, "anbi 175. paleofantasy: the evidence for our early ancestors": 114, "ansc 100. special topics in sociocultural anthropology": 115, "ansc 101. aging: culture and health in late life human development": 116, "ansc 101a. korean wave media and cultural change": 117, "ansc 104. the us-mexico border": 118, "ansc 105. global health and inequality": 119, "ansc 105gs. global health and inequality": 120, "ansc 105s. global health and inequality": 121, "ansc 106. global health: indigenous medicines in latin america": 122, "ansc 106gs. global health: indigenous medicines in latin america": 123, "ansc 106s. global health: indigenous medicines in latin america": 124, "ansc 107. capitalism and empire": 125, "ansc 108. capitalism and money": 126, "ansc 109. capitalism and the state": 127, "ansc 110. societies and cultures of the caribbean": 128, "ansc 111. the chinese heritage in taiwan": 129, "ansc 113. language, style, and youth identities": 130, "ansc 114. food cultures of south asia": 131, "ansc 116. languages of the americas: mayan": 132, "ansc 117. transgenderisms": 133, "ansc 118. language and culture": 134, "ansc 119. gesture, communication, and the body": 135, "ansc 119gs. gesture, communication, and the body": 136, "ansc 120. religion and culture": 137, "ansc 121. psychological anthropology": 138, "ansc 122. language in society": 139, "ansc 123. political anthropology": 140, "ansc 124. cultural anthropology": 141, "ansc 125. gender, sexuality, and society": 142, "ansc 125gs. gender, sexuality, and society": 143, "ansc 126. childhood and adolescence": 144, "ansc 127. discourse, interaction, and social life": 145, "ansc 129. meaning and healing": 146, "ansc 130. hinduism": 147, "ansc 131. language, law, and social justice": 148, "ansc 132. sex and love": 149, "ansc 133. peoples and cultures of the middle east": 150, "ansc 134. the politics of environmental change": 151, "ansc 135. indigenous peoples of latin america": 152, "ansc 135gs. indigenous peoples of latin america": 153, "ansc 136. traditional chinese society": 154, "ansc 137. chinese popular religion": 155, "ansc 138. the cultural design practicum: using anthropology to solve human problems": 156, "ansc 139. native american health and healing": 157, "ansc 141. language and political action": 158, "ansc 142. anthropology of latin america": 159, "ansc 143. mental health as global health priority": 160, "ansc 144. immigrant and refugee health": 161, "ansc 145. indigenous peoples of north america": 162, "ansc 147. global health and the environment": 163, "ansc 148. global health and cultural diversity": 164, "ansc 149. conflict, health, and inequality": 165, "ansc 150. culture and mental health": 166, "ansc 151. us-mexico border ethnographies": 167, "ansc 153. war in lived experience": 168, "ansc 154. gender and religion": 169, "ansc 155. humanitarian aid: what is it good for": 170, "ansc 156. mad films: cultural studies of mental illness in cinema": 171, "ansc 159. the anthropology of marriage": 172, "ansc 160. nature, culture, and environmentalism": 173, "ansc 162. language, identity, and community": 174, "ansc 164. introduction to medical anthropology": 175, "ansc 165. contemporary south asia": 176, "ansc 166. film and culture in asia": 177, "ansc 169. culture and environment: research seminar and practicum": 178, "ansc 171. multimodal methods in ethnography": 179, "ansc 173. ethnography in practice": 180, "ansc 175. money, work, and nature: the anthropology of capitalism": 181, "ansc 177. step into anthrohistory: the past and its hold on the future": 182, "ansc 178. brain, mind, culture, and history": 183, "ansc 180. capitalism and gender": 184, "ansc 181. animal affairs": 185, "ansc 182. gun violence as social pathology": 186, "ansc 183. visualizing the human: film, photography, and digital technologies": 187, "ansc 184. food, culture, and society": 188, "ansc 186. gender and incarceration": 189, "ansc 187. anthropology of mental health in israel and the diaspora": 190, "ansc 188. cultures of healing": 191, "ansc 189. social justice in south asia": 192, "ansc 190. yoga practices: from banaras to beverly hills": 193, "ansc 190gs. medicine and healing in south asia": 194, "ansc 191. stories and selves": 195, "ansc 191gs. everyday life in south asia: beyond the clich\u00e9s": 196, "ansc 192. liberation bound: struggles against capitalism and imperialism worldwide": 197, "ansc 192a. us empire: what is it": 198, "ansc 192gs. rethinking poverty and development": 199, "ansc 193. capitalism and nature": 200, "ansc 193gs. human rights and environmental justice": 201, "ansc 194. language, migration, borders": 202, "ansc 196. human rights advocacy seminar": 203, "anth 1. introduction to culture": 204, "anth 10. climate justice": 205, "anth 101. foundations of social complexity": 206, "anth 102. humans are cultural animals": 207, "anth 104. transforming the global environment": 208, "anth 105. climate change, race, and inequality": 209, "anth 106. climate and civilization": 210, "anth 107. designing for disasters, emergencies, and extreme weather": 211, "anth 108. indigenous peoples, extractive development, and climate change": 212, "anth 109. climate change, cultural heritage, and vulnerability": 213, "anth 110. the climate change seminar": 214, "anth 111. religion and ecology: how religion matters in the anthropocene": 215, "anth 112. regenerative science and human ecology": 216, "anth 120. climate change in california: problems and solutions": 217, "anth 128a. climate action scholars: community engagement and research": 218, "anth 128b. climate action scholars: capstone project": 219, "anth 147. understanding the human social order: anthropology and the long-term": 220, "anth 192. senior seminar in anthropology": 221, "anth 195. instructional apprenticeship in anthropology": 222, "anth 196a. honors studies in anthropology": 223, "anth 196b. honors studies in anthropology": 224, "anth 196c. honors studies in anthropology": 225, "anth 197. field studies": 226, "anth 198. directed group study": 227, "anth 199. independent study": 228, "anth 2. human origins": 229, "anth 200. special topics in anthropology graduate studies": 230, "anth 201. special topics in anthropological archaeology": 231, "anth 202. olmec and maya archaeology": 232, "anth 203. introduction to anthropogeny": 233, "anth 204. contemporary anthropology": 234, "anth 205. postcolonial and decolonial anthropology": 235, "anth 206. race, ethnicity, and citizenship": 236, "anth 207. eastern mediterranean archaeology": 237, "anth 209. archaeology": 238, "anth 21. race and racisms": 239, "anth 211. capitalism and science": 240, "anth 212. advanced topics in biological anthropology": 241, "anth 213. anthropology and mental health": 242, "anth 215. advanced topics in sociocultural anthropology": 243, "anth 219. seminar in political anthropology": 244, "anth 220. the human body in discourse and experience": 245, "anth 221. phenomenology of perception": 246, "anth 222. anthropological studies of subjectivity": 247, "anth 223. anthropological interviewing": 248, "anth 224. the anthropology of gender and sexuality": 249, "anth 226. ethnography of christianity": 250, "anth 227. living in an emotional world": 251, "anth 228. partners not subjects: community-engaged research for anthropologists": 252, "anth 229. religion and healing": 253, "anth 23. debating multiculturalism: race, ethnicity, and class in american societies": 254, "anth 230. department colloquium": 255, "anth 231. maritime archaeology in the eastern mediterranean": 256, "anth 232. labor and semiotics": 257, "anth 233. critical studies of capitalism": 258, "anth 235. theories of social justice": 259, "anth 237. native american health and healing": 260, "anth 238. immigrant and refugee health": 261, "anth 239. contemporary religious movements": 262, "anth 24. mapping capitalism": 263, "anth 241. linguistic anthropology workshop": 264, "anth 242. anthropology of latin america": 265, "anth 243. mental health as global health priority": 266, "anth 244. andean prehistory: origins of chiefdoms and states": 267, "anth 245. the middle horizon": 268, "anth 246. the inca and the late horizon": 269, "anth 247. multimodal interaction": 270, "anth 248. global health and cultural diversity": 271, "anth 249. gender and mental health": 272, "anth 250. the anthropology of human rights": 273, "anth 251. the ethnography of modernity": 274, "anth 253. who cares": 275, "anth 254. dissertation practicum": 276, "anth 256. seminar on brain evolution": 277, "anth 257. mind, self, and identity": 278, "anth 258. analytical methods in archaeology": 279, "anth 259. gender and mental health": 280, "anth 260. seminar in medical and psychological anthropology": 281, "anth 261. audio and video methods in ethnography": 282, "anth 262. critical anthropology workshop": 283, "anth 263. beyond the genome": 284, "anth 264. human evolutionary genetics": 285, "anth 265. marine and coastal archaeology: israel and the neighboring lands": 286, "anth 266. anthropology of love": 287, "anth 267. decolonizing ethnography: ethics, politics, and praxis": 288, "anth 268, cogr 225a, higr 238, phil 209a, socg 255a. introduction to science studies, part i": 289, "anth 268. introduction to science studies: part i": 290, "anth 269, cogr 225d, higr 241, phil 209d, socg 255d. introduction to science studies, part ii": 291, "anth 269. introduction to science studies: part ii": 292, "anth 270. the archaeology of climate change": 293, "anth 271. ethics and survival skills in academia": 294, "anth 272, cogr 225b, higr 239, phil 209b, socg 255b. seminar in science studies": 295, "anth 272. seminar in science studies": 296, "anth 273, cogr 225c, higr 240, phil 209c, socg 255c. colloquium in science studies": 297, "anth 273. colloquium in science studies": 298, "anth 274. debates in anthropology": 299, "anth 275. paleoethnobotany": 300, "anth 276. global mental health": 301, "anth 277. critique of value and the value of critique": 302, "anth 278. anthropological methods": 303, "anth 279. special topics in language and society": 304, "anth 280a. core seminar in social anthropology": 305, "anth 280b. core seminar in cultural anthropology": 306, "anth 280c. core seminar in psychological anthropology": 307, "anth 280d. core seminar in anthropological archaeology": 308, "anth 280e. core seminar in biological anthropology": 309, "anth 280f. language, semiosis, culture": 310, "anth 281a. proseminar": 311, "anth 281b. proseminar": 312, "anth 281c. anthropology proseminar": 313, "anth 283a. fieldwork seminar": 314, "anth 284. master writing practicum": 315, "anth 285. grants writing practicum": 316, "anth 287. ethnography practicum": 317, "anth 288. archaeology practicum": 318, "anth 289s. tanzania anthropogeny study tour": 319, "anth 291. archaeology of highland mexico": 320, "anth 292. social evolution/iron age levant": 321, "anth 293. primate socioecology": 322, "anth 295. master": 323, "anth 296. dissertation fieldwork proposal preparation": 324, "anth 297. research practicum": 325, "anth 298. independent study": 326, "anth 299. dissertation research": 327, "anth 3. global archaeology": 328, "anth 4. words and worlds: introduction to linguistic anthropology": 329, "anth 42. primates in a human-dominated world": 330, "anth 43. introduction to biology and culture of race": 331, "anth 45. wisdom and ecstasy": 332, "anth 5. the human machine": 333, "anth 500. apprentice teaching": 334, "anth 87. first-year student seminar": 335, "astr 101. astrophysical dynamics": 336, "astr 102. electrodynamics and optics for astrophysicists": 337, "astr 103. dynamics of radiation and fluids": 338, "astr 104. thermal astrophysics": 339, "astr 105. fundamentals of quantum mechanics": 340, "astr 106. quantum mechanics of radiation, atoms and molecules": 341, "astr 120. stellar astrophysics": 342, "astr 121. the explosive universe": 343, "astr 122. physical cosmology": 344, "astr 123. galaxies": 345, "astr 124. exoplanets": 346, "astr 130. astrobiology": 347, "astr 131. from the stars to earth: using nuclear energy": 348, "astr 150. observational optical research lab": 349, "astr 151. advanced observational optical research lab": 350, "astr 152. observational radio research lab": 351, "astr 154. data science in astronomy": 352, "astr 155. computational astrophysics": 353, "astr 191. undergraduate seminar in astronomy and astrophysics": 354, "astr 198. directed group study: astrophysics": 355, "astr 199. research for undergraduates": 356, "astr 199h. honors thesis research for undergraduates": 357, "astr 200. survey of astronomy": 358, "astr 201. radiative processes in astrophysics": 359, "astr 202. astrophysical fluid dynamics": 360, "astr 210. planets and exoplanets": 361, "astr 211. stellar structure and evolution": 362, "astr 212. physics of the interstellar medium": 363, "astr 213. galaxies and galactic dynamics": 364, "astr 214. physical cosmology": 365, "astr 215. stellar remnants": 366, "astr 220. astronomical instrumentation and observational techniques": 367, "astr 221. computational astrophysics": 368, "astr 222. astrophysical kinetics": 369, "astr 223. astrostatistics": 370, "astr 224. astrophysical dynamics": 371, "astr 225. astrophysical plasmas": 372, "astr 226. observational astrophysics research lab": 373, "astr 227. parallel computing techniques": 374, "astr 230. special topics": 375, "astr 250. astronomy and astrophysics colloquium": 376, "astr 251. astronomy and astrophysics journal club": 377, "astr 291. professional development in astronomy and astrophysics": 378, "astr 298. directed studies in astronomy and astrophysics": 379, "astr 299. thesis research in astronomy and astrophysics": 380, "astr 500. astronomical teaching training": 381, "aud 236. preceptorship in neuro-otology": 382, "aud 255. anatomy and physiology of the auditory and vestibular systems": 383, "aud 257. ear diseases and treatment": 384, "aud 263. physiological and behavioral tests of vestibular function": 385, "aud 265. aural rehabilitation": 386, "aud 271. temporal bone anatomy and neuroanatomy": 387, "aud 272. central auditory processing assessment and management": 388, "aud 274. advanced technical aspects of hearing amplification": 389, "aud 275. intraoperative monitoring": 390, "aud 276. cochlear implants and other implantable sensory aids": 391, "aud 278. special topics in audiology": 392, "aud 291. clinical case studies/staffing": 393, "aud 296. research practicum": 394, "aud 298. independent research": 395, "aud 299. doctoral project": 396, "awp 10. language and learning in the american academy": 397, "awp 100. writing a researched argument": 398, "awp 101. writing about science": 399, "awp 102. writing for the professions": 400, "awp 102r. writing for the professions": 401, "awp 103. writing about the law": 402, "awp 104. writing about climate change": 403, "awp 10r. language and learning in the american academy": 404, "awp 3. analytical writing": 405, "awp 4a. analytical writing and academic english a": 406, "awp 4b. analytical writing and academic english b": 407, "beng 1. introduction to bioengineering": 408, "beng 100. introduction to probability and statistics for bioengineers": 409, "beng 102. molecular components of living systems": 410, "beng 103b. bioengineering mass transfer": 411, "beng 110. musculoskeletal biomechanics": 412, "beng 112a. soft tissue biomechanics": 413, "beng 112b. fluid and cell biomechanics": 414, "beng 120. organic chemistry structural and design principles": 415, "beng 122a. biosystems and control": 416, "beng 123. dynamic simulation in bioengineering": 417, "beng 125. modeling and computation in bioengineering": 418, "beng 130. biotechnology thermodynamics and kinetics": 419, "beng 133. numerical analysis and computational engineering": 420, "beng 134. measurements, statistics, and probability": 421, "beng 135. biomedical signals and systems": 422, "beng 140a. bioengineering physiology": 423, "beng 140b. bioengineering physiology": 424, "beng 141. biomedical optics and imaging": 425, "beng 152. biosystems engineering laboratory": 426, "beng 160. chemical and molecular bioengineering techniques": 427, "beng 161a. bioreactor engineering": 428, "beng 161b. biochemical engineering": 429, "beng 162. biotechnology laboratory": 430, "beng 166a. cell and tissue engineering": 431, "beng 168. biomolecular engineering": 432, "beng 172. bioengineering laboratory": 433, "beng 183. applied genomic technologies": 434, "beng 186a. principles of biomaterials design": 435, "beng 186b. principles of bioinstrumentation design": 436, "beng 187a. bioengineering design project: planning": 437, "beng 187b. bioengineering design project: development": 438, "beng 187c. bioengineering design project: implementation": 439, "beng 187d. bioengineering design project: presentation": 440, "beng 188a. design development in bioengineering": 441, "beng 188b. design implementation in bioengineering": 442, "beng 189. physiological systems engineering": 443, "beng 190. special topics in bioengineering": 444, "beng 193. clinical experience in bioengineering": 445, "beng 195. teaching": 446, "beng 196. bioengineering industrial internship": 447, "beng 197. engineering internship": 448, "beng 198. directed group study": 449, "beng 199. independent study for undergraduates": 450, "beng 2. introductory computer programming and matlab": 451, "beng 204. systems medicine: data analytics and mechanisms": 452, "beng 207. topics in bioengineering": 453, "beng 208. topics in bioengineering with lab": 454, "beng 211. systems biology and bioengineering i: biological components": 455, "beng 212. systems biology and bioengineering ii: large-scale data analysis": 456, "beng 213. systems biology and bioengineering iii: building and simulating large-scale in silico models": 457, "beng 216. neuromorphic integrated bioelectronics": 458, "beng 219. data science for multiscale biology": 459, "beng 221. mathematical methods for bioengineering": 460, "beng 223. thermodynamics, statistical mechanics, interfacial phenomena in living systems": 461, "beng 224. regulatory affairs": 462, "beng 225. business of biotech": 463, "beng 226. foundations of bioengineering i: tissue and cell properties": 464, "beng 227. transport phenomena in living systems": 465, "beng 230a. biochemistry": 466, "beng 230b. cell and molecular biology": 467, "beng 230c. cardiovascular physiology": 468, "beng 230d. respiratory and renal physiology": 469, "beng 232. musculoskeletal health, injury, and disease": 470, "beng 233. neuromuscular physiology and biomechanics": 471, "beng 234. intro to neurophysiology: molecules to systems": 472, "beng 235. molecular imaging and quantitation in living cells": 473, "beng 241a. tissue engineering and regenerative medicine: foundations": 474, "beng 241b. tissue engineering and regenerative medicine: cell microenvironment": 475, "beng 241c. tissue engineering and regenerative medicine: development and growth": 476, "beng 254. synthetic biology": 477, "beng 267. microcirculation in health and disease": 478, "beng 280b. comparative biomedical imaging": 479, "beng 280c. imaging cardiovascular disease": 480, "beng 281. seminar in bioengineering": 481, "beng 282. seminar: faculty research": 482, "beng 292. scientific ethics": 483, "beng 294a. patient-centered clinical medicine for bioengineers": 484, "beng 294b. engineering in the patient healthcare system": 485, "beng 294c. clinical experience in bioengineering": 486, "beng 295. bioengineering design project and industrial training": 487, "beng 296. independent study": 488, "beng 298. directed group study": 489, "beng 298l. laboratory research rotation": 490, "beng 299. graduate research": 491, "beng 500. apprentice teaching for specialization in multi-scale biology": 492, "beng 501. teaching experience": 493, "beng 87. first-year student seminar": 494, "beng 91. topics in bioengineering and medicine": 495, "beng 97. internship/field studies": 496, "beng 98. directed group study": 497, "beng 99. independent study for undergraduates": 498, "beng 99h. independent study": 499, "bggn 200. graduate school fundamentals: introduction to graduate studies in the school of biological sciences": 500, "bggn 201. methods in computational neuroscience": 501, "bggn 202. professional development for biologists": 502, "bggn 203. topics in ecology, behavior, and evolution": 503, "bggn 204. topics in community and population ecology": 504, "bggn 205. communicating science": 505, "bggn 206a. concepts of reasoning and experimentation (core) i": 506, "bggn 206b. concepts of reasoning and experimentation (core) ii": 507, "bggn 207. scientific ethics": 508, "bggn 208. biological sciences graduate boot camp": 509, "bggn 209. social issues in biology": 510, "bggn 211. recent advances and experimental approaches in modern biology": 511, "bggn 212. introduction to quantitative evolutionary biology": 512, "bggn 213. foundations of bioinformatics": 513, "bggn 214. introduction to q-biology": 514, "bggn 215. applied bioinformatics lab": 515, "bggn 216. graduate biostatistics": 516, "bggn 218. principles of drug development and pharmacology": 517, "bggn 220. graduate molecular biology": 518, "bggn 222. graduate cell biology": 519, "bggn 223. graduate genetics": 520, "bggn 225. graduate immunology": 521, "bggn 226. graduate animal virology": 522, "bggn 227. graduate topics in plant biology": 523, "bggn 228. graduate developmental biology": 524, "bggn 230. graduate signal transduction": 525, "bggn 231. current concepts in stem cell biology": 526, "bggn 232. innate immunity": 527, "bggn 234. practical histopathology and mouse models of human disease": 528, "bggn 236. advanced glycobiology": 529, "bggn 237. quantitative methods in genetics": 530, "bggn 238a. integrative microbiology i": 531, "bggn 238b. integrative microbiology ii": 532, "bggn 239. bioinformatics for immunologists": 533, "bggn 240. neural data science": 534, "bggn 241. genome science": 535, "bggn 245. advanced topics in cancer research and therapy": 536, "bggn 246a. computational neurobiology": 537, "bggn 248. molecular mechanisms of neural development": 538, "bggn 250. developmental neurobiology": 539, "bggn 251. computational cellular neurobiology": 540, "bggn 252. computational systems neurobiology": 541, "bggn 253. neurobiology of stress and mental disorders": 542, "bggn 254. neuroanatomy": 543, "bggn 255. systems and circuits neuroscience": 544, "bggn 257. bioclock workshop": 545, "bggn 259. quantitative physiology": 546, "bggn 260. neurodynamics": 547, "bggn 261. microbiome function laboratory": 548, "bggn 262. 3-d cryo-electron microscopy of macromolecules and cells": 549, "bggn 266. advanced laboratory in biophysical techniques": 550, "bggn 267. computational models and theories in neuroscience": 551, "bggn 270. master of science fundamentals": 552, "bggn 271. advanced experimental methods in biology": 553, "bggn 272. learning theories": 554, "bggn 273. biostatistics for master\u2019s students": 555, "bggn 275. lab methodology": 556, "bggn 276. lab analysis": 557, "bggn 280. advanced topics in modern biology: biochemistry": 558, "bggn 281. advanced topics in modern biology: cellular development": 559, "bggn 282. advanced topics in modern biology: ecology, behavior, and evolution": 560, "bggn 283. advanced topics in modern biology: molecular biology": 561, "bggn 284. advanced topics in modern biology: physiology and neuroscience": 562, "bggn 285. advanced topics in modern biology": 563, "bggn 290. advances in cellular and molecular mechanisms": 564, "bggn 292. professional pathways in biological sciences": 565, "bggn 293. scientific writing in biology": 566, "bggn 294. transitional laboratory projects in biology": 567, "bggn 295. scientific presentation in biology": 568, "bggn 297. research conference": 569, "bggn 298. laboratory projects in biology": 570, "bggn 299. thesis research in biology": 571, "bggn 500. introduction to college biology education": 572, "bgjc 204. cellular and molecular immunology": 573, "bgjc 207. journal club in neurobiology": 574, "bgjc 208. journal club in plant molecular biology": 575, "bgjc 213. journal club in computational neurobiology": 576, "bgjc 215. journal club in biology education research": 577, "bgrd 200. research discussion": 578, "bgse 200. seminar in biology": 579, "bgse 205. graduate research seminar": 580, "bibc 100. structural biochemistry": 581, "bibc 102. metabolic biochemistry": 582, "bibc 103. biochemical techniques": 583, "bibc 110. catalysis, reactivity, and molecular structure": 584, "bibc 120. nutrition": 585, "bibc 151. chemistry of biological interactions": 586, "bibc 194. advanced topics in modern biology: biochemistry": 587, "bicd 110r. cell biology": 588, "bicd 112. stem cells and regeneration": 589, "bicd 120. molecular basis of plant development": 590, "bicd 123. plant molecular genetics and biotechnology laboratory": 591, "bicd 124. plant innate immunity": 592, "bicd 130. embryos, genes, and development": 593, "bicd 136. aids science and society": 594, "bicd 140. immunology": 595, "bicd 145. laboratory in molecular medicine": 596, "bicd 156. population genetics": 597, "bicd 158. active genetics": 598, "bicd 194. advanced topics in modern biology: cellular development": 599, "bieb 102. introductory ecology\u2014organisms and habitat": 600, "bieb 121. ecology laboratory": 601, "bieb 123. molecular methods in evolution and ecology lab": 602, "bieb 126. plant ecology": 603, "bieb 128. insect diversity": 604, "bieb 130. marine conservation biology": 605, "bieb 131. marine invertebrate ecology lab": 606, "bieb 134. introduction to biological oceanography": 607, "bieb 135. aquatic ecology lab": 608, "bieb 136gs. tropical field ecology": 609, "bieb 137gs. sea turtle ecology and conservation": 610, "bieb 138gs. biodiversity of the galapagos island and mainland ecuador": 611, "bieb 140. biodiversity": 612, "bieb 141. introduction to quantitative modeling for biologists\u2019 lab": 613, "bieb 143. computer modeling in evolution and ecology": 614, "bieb 146. genome diversity and dynamics": 615, "bieb 148. disease ecology": 616, "bieb 150. evolution": 617, "bieb 152. evolution of infectious diseases": 618, "bieb 154. evolutionary inquiry": 619, "bieb 156. evolution and society": 620, "bieb 158. microbiomes: the ecology and evolution of microbes": 621, "bieb 159. microbiome function laboratory": 622, "bieb 164. behavioral ecology and conservation": 623, "bieb 166. animal behavior and communication": 624, "bieb 174. ecosystems and global change": 625, "bieb 176. biology of conservation and the human predicament": 626, "bieb 182. biology of global change": 627, "bieb 194. advanced topics in modern biology: ecology, behavior, evolution": 628, "bild 1. the cell": 629, "bild 10. fundamental concepts of modern biology": 630, "bild 12. neurobiology and behavior": 631, "bild 18. human impact on the environment": 632, "bild 2. multicellular life": 633, "bild 20. human genetics in modern society": 634, "bild 22. human nutrition": 635, "bild 24. learning microbiology through fermented food": 636, "bild 26. human physiology": 637, "bild 28. immunology, vaccines, and immunotherapy": 638, "bild 3. organismic and evolutionary biology": 639, "bild 30. biology of plagues: past and present": 640, "bild 32. introduction to cancer biology": 641, "bild 36. aids science and society": 642, "bild 38. dementia, science, and society": 643, "bild 4. introductory biology lab": 644, "bild 42. our sustainable future": 645, "bild 44. scientific perspectives for a changing world": 646, "bild 46. ecology of a changing planet": 647, "bild 5. data analysis and design for biologists": 648, "bild 60. exploring issues of diversity, equity, and inclusion in relation to human biology": 649, "bild 60gs. exploring issues of diversity, equity, and inclusion in biological and global contexts": 650, "bild 61. biology, race, and society": 651, "bild 62. introduction to python for biologists": 652, "bild 7. the beginning of life": 653, "bild 70. genomics research initiative lab i": 654, "bild 75. essential lab techniques in the biological sciences": 655, "bild 80. job and internship preparation: job application": 656, "bild 81. job and internship preparation: interview skills": 657, "bild 82. job and internship preparation: professional development skills": 658, "bild 83. business communications for biological sciences": 659, "bild 84r. career exploration in biological sciences": 660, "bild 87. first-year seminar": 661, "bild 88. learning sustainable well-being: compassion for self and others, a biologist\u2019s perspective": 662, "bild 91. biology first-year students: strategies for success": 663, "bild 92. professional development topics in the biological sciences": 664, "bild 95. undergraduate workshops": 665, "bild 97. topics in modern biology: professional development and analysis": 666, "bild 98. directed group study": 667, "bild 99. independent research": 668, "bimm 100. molecular biology": 669, "bimm 101. recombinant dna techniques": 670, "bimm 110. molecular basis of human disease": 671, "bimm 112. regulation of eukaryotic gene expressions": 672, "bimm 114. virology": 673, "bimm 116. circadian rhythms\u2014biological clocks": 674, "bimm 116b. bioclock studio": 675, "bimm 116r. circadian rhythms\u2014biological clocks": 676, "bimm 118. pharmacology": 677, "bimm 120. microbiology": 678, "bimm 121. microbiology laboratory": 679, "bimm 122. microbial genetics": 680, "bimm 124. medical microbiology": 681, "bimm 128. finding the fountain of youth\u2014introduction to the modern biology of aging": 682, "bimm 130. microbial physiology": 683, "bimm 132gs. microbial diversity and evolution": 684, "bimm 134. biology of cancer": 685, "bimm 140. quantitative principles in biology": 686, "bimm 143. bioinformatics laboratory": 687, "bimm 143r. bioinformatics laboratory": 688, "bimm 149. computation for biologists": 689, "bimm 170. genomics research initiative laboratory ii": 690, "bimm 172. genome science": 691, "bimm 174. genomics, big data, and human health": 692, "bimm 181. molecular sequence analysis": 693, "bimm 182. biological databases": 694, "bimm 184. computational molecular biology": 695, "bimm 185. bioinformatics laboratory (advanced)": 696, "bimm 194. advanced topics in modern biology: molecular biology": 697, "biom 200a. molecules to organisms: concepts": 698, "biom 200b. molecules to organisms: approaches": 699, "biom 201. seminars in biomedical research": 700, "biom 202. biomedical sciences research rotation": 701, "biom 209. lipid cell signaling genomics, proteomics, and metabolomics": 702, "biom 218. current topics in anthropogeny": 703, "biom 219. ethics in scientific research": 704, "biom 222. essentials of glycobiology": 705, "biom 224. topics in cancer research": 706, "biom 225. introduction to anthropogeny": 707, "biom 226. hormone action": 708, "biom 227. mouse models of human disease": 709, "biom 228. modern drug discovery technologies": 710, "biom 229. advanced anthropogeny": 711, "biom 231. contemporary topics in pharmacology": 712, "biom 232. in vivo cellular and molecular imaging": 713, "biom 233. structural biology in cell signaling and drug discovery": 714, "biom 234. practical histopathology and mouse models of human diseases": 715, "biom 235. pharmacogenomics": 716, "biom 240. critical reading in cell biology": 717, "biom 242. seminar in genetics": 718, "biom 246. current literature in glycobiology": 719, "biom 252. genetics and genomics": 720, "biom 253. pathogens and host defense": 721, "biom 254. molecular and cell biology": 722, "biom 255. molecular basis of drug action and disease therapy": 723, "biom 256. molecular pathology of cancer": 724, "biom 262. quantitative methods in genetics": 725, "biom 264. molecular and cellular basis of disease": 726, "biom 266. environmental and molecular toxicology": 727, "biom 267. drug discovery, development, and commercialization": 728, "biom 272. seminars in genetics": 729, "biom 273. seminars in microbiology": 730, "biom 274. seminars in molecular and cell biology": 731, "biom 275. seminars in pharmacology": 732, "biom 276. seminars in physiology": 733, "biom 277. seminars in molecular pathology": 734, "biom 283. supramolecular structure determination laboratory": 735, "biom 285. statistical inference in the medical sciences": 736, "biom 287. tissue engineering laboratory": 737, "biom 294. pharmacology and molecular biology journal club": 738, "biom 295. pharmacology research discussions": 739, "biom 296. directed reading": 740, "biom 297. progress in signal transduction": 741, "biom 298. directed study": 742, "biom 299. independent study or research": 743, "bipn 100. human physiology i": 744, "bipn 100r. human physiology i": 745, "bipn 102. human physiology ii": 746, "bipn 103. human anatomy with lab": 747, "bipn 105. human physiology lab": 748, "bipn 106. comparative physiology": 749, "bipn 108. biology and medicine of exercise": 750, "bipn 118. neuropharmacology": 751, "bipn 120. endocrinology": 752, "bipn 134. human reproduction": 753, "bipn 140. cellular neurobiology": 754, "bipn 142. systems neurobiology": 755, "bipn 144. developmental neurobiology": 756, "bipn 145. neurobiology laboratory": 757, "bipn 146. computational cellular neurobiology": 758, "bipn 147. computational systems neurobiology": 759, "bipn 148. cellular basis of learning and memory": 760, "bipn 150. diseases of the nervous system": 761, "bipn 152. the healthy and diseased brain": 762, "bipn 154. neurobiology of stress and mental disorders": 763, "bipn 156. glial neurobiology": 764, "bipn 160. neuroanatomy": 765, "bipn 162. neural data science": 766, "bipn 164. computational models and theories in neuroscience": 767, "bipn 189. brain, behavior, and evolution": 768, "bipn 194. advanced topics in modern biology: physiology and neuroscience": 769, "bisp 170. bioscholars seminar: from bench to bedside and beyond": 770, "bisp 175. advanced essential lab techniques in the biological sciences": 771, "bisp 182. cooperative education and analysis": 772, "bisp 191. biology transfers: strategies for success": 773, "bisp 192. senior seminar in biology": 774, "bisp 193. biology education research": 775, "bisp 194. advanced topics in modern biology": 776, "bisp 195p. pedagogy and learning apprenticeship": 777, "bisp 196. honors thesis in biological sciences": 778, "bisp 197. biology internship program": 779, "bisp 198. directed group study": 780, "bisp 199. individual research for undergraduates": 781, "bnfo 262. quantitative methods in genetics": 782, "bnfo 281. seminar in bioinformatics and systems biology": 783, "bnfo 283. bioinformatics student research talks": 784, "bnfo 284. nonlinear dynamics in quantitative biology": 785, "bnfo 285. statistical learning in bioinformatics": 786, "bnfo 286. network biology and biomedicine": 787, "bnfo 294. scientific ethics": 788, "bnfo 298. research rotation": 789, "cat 1. culture, art, and technology 1": 790, "cat 124. sixth college practicum": 791, "cat 124gs. sixth college practicum global seminar": 792, "cat 124rs. sixth college practicum online global seminar": 793, "cat 125. public rhetoric and practical communication": 794, "cat 125gs. public rhetoric and practical communication global seminar": 795, "cat 125r. public rhetoric and practical communication online": 796, "cat 125rs. public rhetoric and practical communication online global seminar": 797, "cat 192. senior seminar in culture, art, and technology": 798, "cat 195. apprentice teaching": 799, "cat 197. culture, art, and technology field studies": 800, "cat 198. culture, art, and technology directed group studies": 801, "cat 199. culture, art, and technology independent studies": 802, "cat 2. culture, art, and technology 2": 803, "cat 24. introduction to special projects/topics": 804, "cat 2ce. writing and community 1": 805, "cat 3. culture, art, and technology 3": 806, "cat 3ce. writing and community 2": 807, "cat 75. experience art!\u2014sixth college seminar series": 808, "cat 87. first-year student seminar": 809, "cat 90. introduction to experiential learning seminar": 810, "cat 98. culture, art, and technology lower-division group study": 811, "cce 1. critical approaches in community practice": 812, "cce 2. cultivating community-informed practices": 813, "cce 3. elements of community-engaged collaborative research": 814, "ccs 101. carbon neutrality initiative at university of california": 815, "ccs 102. research perspectives on climate change": 816, "ccs 123. policy and politics of climate change": 817, "ccs 197. carbon neutrality internship": 818, "ccs 199. supervised independent study or research": 819, "ceng 100. material and energy balances": 820, "ceng 101a. introductory fluid mechanics": 821, "ceng 101b. heat transfer": 822, "ceng 101c. mass transfer": 823, "ceng 102. chemical engineering thermodynamics": 824, "ceng 110. material and energy balances with applications": 825, "ceng 113. chemical reaction engineering": 826, "ceng 114. probability and statistical methods for engineers (4)": 827, "ceng 120. chemical process dynamics and control": 828, "ceng 122. separation processes": 829, "ceng 124a. chemical plant and process design i": 830, "ceng 124b. chemical plant and process design ii": 831, "ceng 134. polymeric materials": 832, "ceng 15. engineering computation using matlab": 833, "ceng 157. process technology in the semiconductor industry (4)": 834, "ceng 15r. engineering computation using matlab online": 835, "ceng 160. introduction to biochemical engineering": 836, "ceng 170. experimental methods for chemical engineers": 837, "ceng 175. nanoengineering in medicine": 838, "ceng 176a. chemical engineering process laboratory i": 839, "ceng 176b. chemical engineering process laboratory ii": 840, "ceng 199. independent study for undergraduates": 841, "ceng 205. graduate seminar in chemical and nano engineering": 842, "ceng 207. nanomedicine": 843, "ceng 208. nanofabrication": 844, "ceng 210a. fluid mechanics i": 845, "ceng 211. introduction to nanoengineering": 846, "ceng 212. intermolecular and surface forces": 847, "ceng 213. nanoscale characterization": 848, "ceng 214. nanoscale physics and modeling": 849, "ceng 215. nanosystems integration": 850, "ceng 221a. heat transfer": 851, "ceng 221b. mass transfer": 852, "ceng 230. synchrotron characterization of nanomaterials": 853, "ceng 251. thermodynamics": 854, "ceng 252. chemical reaction engineering": 855, "ceng 253. heterogeneous catalysis": 856, "ceng 254. biochemical engineering fundamentals": 857, "ceng 255. electrochemical engineering": 858, "ceng 256. biomaterials and biomimetics (4)": 859, "ceng 257. process technology in the semiconductor industry (4)": 860, "ceng 260. introduction to biochemical engineering (4)": 861, "ceng 273. principles of immune engineering": 862, "ceng 296. independent study in chemical engineering": 863, "ceng 297. directed group study": 864, "ceng 299. graduate research in chemical engineering": 865, "ceng 4. experience chemical engineering (1)": 866, "ceng 501. teaching experience (2)": 867, "cgs 100a. conceptualizing gender: theoretical approaches": 868, "cgs 100b. conceptualizing gender: methods and methodologies": 869, "cgs 101. gender and globalization": 870, "cgs 105. queer theory": 871, "cgs 106. gender and the law": 872, "cgs 108. gender, race, and artificial intelligence": 873, "cgs 109. sexual violence": 874, "cgs 110. intersectional struggles for environmental justice": 875, "cgs 111. gender and the body": 876, "cgs 112. sexuality and nation": 877, "cgs 113. gender and sexuality in the arts": 878, "cgs 114. gender, race, ethnicity, and class": 879, "cgs 116. feminist social movements": 880, "cgs 117. transgenderisms": 881, "cgs 118. gender and incarceration": 882, "cgs 119. asian american film, video, and new media: the politics of pleasure": 883, "cgs 120. capitalism and gender": 884, "cgs 121. selected topics in critical gender studies": 885, "cgs 122. advanced topics in comparative perspectives": 886, "cgs 123. gender and reproductive politics": 887, "cgs 124. girls and sexuality": 888, "cgs 125. women of color writers": 889, "cgs 126. muslims on gender and sexuality": 890, "cgs 127. feminist border studies": 891, "cgs 128. transnational feminisms": 892, "cgs 130. queer performativity": 893, "cgs 134. gender and climate justice": 894, "cgs 135. feminist science and technology studies": 895, "cgs 136. gender, tech, and development": 896, "cgs 137. latina issues and cultural production": 897, "cgs 147. black feminisms, past and present": 898, "cgs 150. visuality, sexuality, and race": 899, "cgs 165. gender and sexuality in african american communities": 900, "cgs 167a. decolonial muslim feminisms": 901, "cgs 187. latinx sexualities": 902, "cgs 190. honors seminar": 903, "cgs 196a. critical gender studies honors research": 904, "cgs 196b. honors thesis": 905, "cgs 198. directed group study": 906, "cgs 199. independent study": 907, "cgs 200. advanced studies in critical gender studies": 908, "cgs 208. gender variance": 909, "cgs 280. special topics in critical gender studies": 910, "cgs 299. advanced practicum in critical gender studies": 911, "cgs 2a. introduction to critical gender studies: key terms and concepts": 912, "cgs 2b. introduction to critical gender studies: social formations": 913, "cgs 500. apprentice teaching in critical gender studies": 914, "cgs 87. critical gender studies first-year seminar": 915, "chem 1. the scope of chemistry and biochemistry": 916, "chem 100a. analytical chemistry laboratory": 917, "chem 100b. instrumental chemistry laboratory": 918, "chem 103. mass spectrometry in research laboratory": 919, "chem 104. introduction to x-ray crystallography": 920, "chem 105a. physical chemistry laboratory": 921, "chem 105b. physical chemistry laboratory": 922, "chem 108. protein biochemistry laboratory": 923, "chem 109. recombinant dna laboratory": 924, "chem 11. the periodic table": 925, "chem 111. origins of life and the universe": 926, "chem 113. biophysical chemistry of macromolecules": 927, "chem 114a. biochemical structure and function": 928, "chem 114b. biochemical energetics and metabolism": 929, "chem 114c. biosynthesis of macromolecules": 930, "chem 114d. molecular and cellular biochemistry": 931, "chem 115. genome, epigenome, and transcriptome editing": 932, "chem 116. chemical biology": 933, "chem 117. biomedical research in health disparities": 934, "chem 118. pharmacology and toxicology": 935, "chem 119. rna biochemistry": 936, "chem 12. molecules and reactions": 937, "chem 120a. inorganic chemistry i": 938, "chem 120b. inorganic chemistry ii": 939, "chem 123. advanced inorganic chemistry laboratory": 940, "chem 125. bioinorganic chemistry": 941, "chem 126a. physical biochemistry i: thermodynamics and kinetics of biomolecules": 942, "chem 126b. physical biochemistry ii: quantum and statistical mechanics of biomolecules": 943, "chem 13. chemistry of life": 944, "chem 130. chemical physics: quantum mechanics": 945, "chem 131. chemical physics: stat thermo i": 946, "chem 132. chemical physics: stat thermo ii": 947, "chem 134. polymeric materials": 948, "chem 135. molecular spectroscopy": 949, "chem 141. organic nanomaterials": 950, "chem 142. introduction to glycosciences": 951, "chem 143b. organic chemistry laboratory": 952, "chem 143c. organic chemistry laboratory": 953, "chem 143d. molecular design and synthesis": 954, "chem 145. biofuels and renewable materials": 955, "chem 146. kinetics and mechanism of organic reactions": 956, 